<a href="https://colab.research.google.com/github/poonamkhot123/Numpy-Pandas-Library/blob/main/Session_16_1%5Bimp_Series_Methods%5D.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Some important Series methods.

In [ ]:
# astype
# between
# clip
# drop_duplicates
# isnull
# dropna
# fillna
# isin
# apply
# copy

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
subs = pd.read_csv("/content/subs.csv").iloc[:,0]
subs

0       48
1       57
2       40
3       43
4       44
      ...
360    231
361    226
362    155
363    144
364    172
Name: Subscribers gained, Length: 365, dtype: int64

In [ ]:
type(subs)

pandas.core.series.Series

In [ ]:
vk = pd.read_csv("/content/kohli_ipl.csv").iloc[:,0]
vk

0        1
1        2
2        3
3        4
4        5
      ...
210    211
211    212
212    213
213    214
214    215
Name: match_no, Length: 215, dtype: int64

In [ ]:
moive = pd.read_csv("/content/bollywood.csv").iloc[:,0]
moive

0                   Uri: The Surgical Strike
1                              Battalion 609
2       The Accidental Prime Minister (film)
3                            Why Cheat India
4                            Evening Shadows
                        ...
1495                  Hum Tumhare Hain Sanam
1496                     Aankhen (2002 film)
1497                         Saathiya (film)
1498                          Company (film)
1499                    Awara Paagal Deewana
Name: movie, Length: 1500, dtype: object

In [ ]:
# astype
import sys
vk
sys.getsizeof(vk)

1884

In [ ]:
sys.getsizeof(vk.astype("int16"))

594

In [ ]:
# between
vk[vk.between(51,99)].size

49

In [ ]:
# clip
vk.clip(51,99)

0      51
1      51
2      51
3      51
4      51
       ..
210    99
211    99
212    99
213    99
214    99
Name: match_no, Length: 215, dtype: int64

In [ ]:
# drop duplicates
temp = pd.Series([1,1,2,2,3,3,4,4,5,5])
temp.drop_duplicates()

0    1
2    2
4    3
6    4
8    5
dtype: int64

In [ ]:
moive.drop_duplicates()

0                   Uri: The Surgical Strike
1                              Battalion 609
2       The Accidental Prime Minister (film)
3                            Why Cheat India
4                            Evening Shadows
                        ...
1495                  Hum Tumhare Hain Sanam
1496                     Aankhen (2002 film)
1497                         Saathiya (film)
1498                          Company (film)
1499                    Awara Paagal Deewana
Name: movie, Length: 1497, dtype: object

In [ ]:
temp.duplicated().sum()

np.int64(5)

In [ ]:
vk.duplicated().sum()

np.int64(0)

In [ ]:
# isnull
temp = pd.Series([1,2,3,np.nan,5,6,np.nan,8,9,np.nan,10])
temp

0      1.0
1      2.0
2      3.0
3      NaN
4      5.0
5      6.0
6      NaN
7      8.0
8      9.0
9      NaN
10    10.0
dtype: float64

In [ ]:
temp.size

11

In [ ]:
temp.count()

np.int64(8)

In [ ]:
# isnull
vk.isnull().sum()

np.int64(0)

In [ ]:
temp.isnull().sum()

np.int64(3)

In [ ]:
# dropna
temp.dropna()

0      1.0
1      2.0
2      3.0
4      5.0
5      6.0
7      8.0
8      9.0
10    10.0
dtype: float64

In [ ]:
#fillna
temp.fillna(0)

0      1.0
1      2.0
2      3.0
3      0.0
4      5.0
5      6.0
6      0.0
7      8.0
8      9.0
9      0.0
10    10.0
dtype: float64

In [ ]:
temp.fillna(temp.mean())

0      1.0
1      2.0
2      3.0
3      5.5
4      5.0
5      6.0
6      5.5
7      8.0
8      9.0
9      5.5
10    10.0
dtype: float64

In [ ]:
#isin
vk

0        1
1        2
2        3
3        4
4        5
      ...
210    211
211    212
212    213
213    214
214    215
Name: match_no, Length: 215, dtype: int64

In [ ]:
vk[(vk == 49) | (vk==99)]

48    49
98    99
Name: match_no, dtype: int64

In [ ]:
#isin
vk[vk.isin([49,99])]

48    49
98    99
Name: match_no, dtype: int64

In [ ]:
#apply
moive

0                   Uri: The Surgical Strike
1                              Battalion 609
2       The Accidental Prime Minister (film)
3                            Why Cheat India
4                            Evening Shadows
                        ...
1495                  Hum Tumhare Hain Sanam
1496                     Aankhen (2002 film)
1497                         Saathiya (film)
1498                          Company (film)
1499                    Awara Paagal Deewana
Name: movie, Length: 1500, dtype: object

In [ ]:
moive.apply(lambda x:x.split()[0].upper())

0            URI:
1       BATTALION
2             THE
3             WHY
4         EVENING
          ...
1495          HUM
1496      AANKHEN
1497     SAATHIYA
1498      COMPANY
1499        AWARA
Name: movie, Length: 1500, dtype: object

In [ ]:
subs

0       48
1       57
2       40
3       43
4       44
      ...
360    231
361    226
362    155
363    144
364    172
Name: Subscribers gained, Length: 365, dtype: int64

In [ ]:
subs.mean()

np.float64(135.64383561643837)

In [ ]:
subs.apply(lambda x:'good day' if x > subs.mean() else 'bad day')

0       bad day
1       bad day
2       bad day
3       bad day
4       bad day
         ...
360    good day
361    good day
362    good day
363    good day
364    good day
Name: Subscribers gained, Length: 365, dtype: object

In [ ]:
#copy
vk

0        1
1        2
2        3
3        4
4        5
      ...
210    211
211    212
212    213
213    214
214    215
Name: match_no, Length: 215, dtype: int64

In [ ]:
vk.head()

0    1
1    2
2    3
3    4
4    5
Name: match_no, dtype: int64

In [ ]:
new= vk.head()
new

0    1
1    1
2    3
3    4
4    5
Name: match_no, dtype: int64

In [ ]:
new[1] = 1

In [ ]:
vk

0        1
1        1
2        3
3        4
4        5
      ...
210    211
211    212
212    213
213    214
214    215
Name: match_no, Length: 215, dtype: int64

In [ ]:
new = vk.head().copy()
new

0    1
1    1
2    3
3    4
4    5
Name: match_no, dtype: int64